benencrombie/arm_stm32_firmware/Src/main.c
#include "main.h"
#include "FSM.h"
#include "GPIO.h"
#include "MotorDriver.h"
#include "PWM.h"
#include "SysTick.h"
#include "USART.h"
#include "stm32f446xx.h"

// prototypes
static void SystemClock_Config_84MHz(void);
// interrupts (also prototypes)
void TIM2_IRQHandler(void);   // Motors 0 and 4 steps
void TIM3_IRQHandler(void);   // Motors 1 and 5 steps
void TIM4_IRQHandler(void);   // Motor 2 steps
void TIM5_IRQHandler(void);   // Motor 3 steps
void USART2_IRQHandler(void); // Debug comms TX

// Initialize ms to the next second, or however frequently we want to do stuff. Highest frequency
// activities as system speed (84 MHz) and milliseconds (1000 Hz)
uint32_t ms_counter = 0;

/**
 * @brief main. does things.
 */
int main(void)
{
    ////////////////////////////
    // Initialize all submodules
    ////////////////////////////

    // Update system clock with CMSIS function
    SystemClock_Config_84MHz();

    // Initialize ticker for ms flags
    SysTick_Initialize();

    // Initialize simple IOs
    GPIO_Initialize();

    // Initialize PWMs on timers
    PWM_Initialize();

    // Initialize UART for debug and comms later
    USART_Initialize();

    // Allow motors to be used
    Motors_FSM_Initialize(); // TODO maybe this and any other small FSMs should be called within the
                             // big FSM. Haven't architected what that'll look like just yet, but
                             // this is good for bringup

    // Enable interrupts.
    __enable_irq();

    // Initialize the FSM
    FSM_Initialize();

#if DEBUG_SYS
    USART2_SendString("Fully Initialized\r\n");
#endif

    while (1)
    {
        // Millisecond loop - 1000 Hz
        if (f_ms)
        {
            // Unflip the flag
            f_ms = 0;

            // Increment ms counter
            ms_counter++;

            // Update overall system logic
            FSM_Tick1000Hz();

            // Every 1 second (1000 ms)
            if (ms_counter == 1000)
            {
                // Reset counter
                ms_counter = 0;

                // Update overall system logic
                FSM_Tick1Hz();
            }
        }
        // Tick the FSM at 84 MHz
        FSM_TickSys();
    }
}

/**
 * System Clock Configuration
 *
 * Main tick, peripheral clocks, etc.
 */

/**
 * @brief configure the clock to be 84MHz (stm32f446 is capable), default is 16MHz. Keeping this in
 * main for visibility
 * @param void
 * @return void
 */
static void SystemClock_Config_84MHz(void)
{
    // NOTE help from claude with this. Similar to what HAL does but stripped down

    // enable power interface clock
    RCC->APB1ENR |= RCC_APB1ENR_PWREN;

    // voltage scaling (needed for higher clocks)
    PWR->CR |= PWR_CR_VOS;

    // Flash config (2 wait states for 84 MHz)
    FLASH->ACR = FLASH_ACR_PRFTEN | FLASH_ACR_ICEN | FLASH_ACR_DCEN | FLASH_ACR_LATENCY_2WS;

    // enable HSI
    RCC->CR |= RCC_CR_HSION;
    while (!(RCC->CR & RCC_CR_HSIRDY))
        ;

    // Don't touch this
    RCC->PLLCFGR = (16 << 0) |  // PLLM is bits [5:0]
                   (336 << 6) | // PLLN is bits [14:6]
                   (7 << 24) |  // PLLQ is bits [27:24]
                   RCC_PLLCFGR_PLLSRC_HSI;

    // PLLP = 4 (encoded as 01 in bits 17:16 on F4)
    RCC->PLLCFGR &= ~(3 << 16);
    RCC->PLLCFGR |= (1 << 16);

    // enable PLL
    RCC->CR |= RCC_CR_PLLON;
    while (!(RCC->CR & RCC_CR_PLLRDY))
        ;

    /**
     * Peripheral bus clocks
     *
     * HCLK = 84 MHz
     * APB1 (PCLK1) = 5.25 MHz
     * - Motor PWMs (TIM2, TIM3, TIM4, TIM5)
     * APB2 (PCLK2) = 84 MHz
     * SYSCLK = 84 MHz
     */

    // AHB, don't prescale, so HCLK = 84 MHz
    RCC->CFGR &= ~RCC_CFGR_HPRE;
    RCC->CFGR |= RCC_CFGR_HPRE_DIV1;

    // APB1, prescale by /16, so PCLK1 = 5.25 MHz. Using these for motor timers, so not super high
    // speed
    RCC->CFGR &= ~RCC_CFGR_PPRE1;
    RCC->CFGR |= RCC_CFGR_PPRE1_DIV16;

    // APB2, prescale by /1, so PCLK2 = 84 MHz
    RCC->CFGR &= ~RCC_CFGR_PPRE2;
    RCC->CFGR |= RCC_CFGR_PPRE2_DIV1;

    // set SYSCLK source from PLL
    RCC->CFGR &= ~RCC_CFGR_SW;
    RCC->CFGR |= RCC_CFGR_SW_PLL;
    while ((RCC->CFGR & RCC_CFGR_SWS) != RCC_CFGR_SWS_PLL)
        ;

    // update CMSIS clock variable
    SystemCoreClockUpdate();
}

/**
 * ISR Operations
 *
 * TIM2 - Motors 0 and 4
 * TIM3 - Motors 1 and 5
 * TIM4 - Motor 2
 * TIM5 - Motor 3
 */

/**
 * @brief TIM2 interrupt handler
 */
void TIM2_IRQHandler(void)
{
    Motors_TIM2_IRQHandler();
}

/**
 * @brief TIM3 interrupt handler
 */
void TIM3_IRQHandler(void)
{
    Motors_TIM3_IRQHandler();
}

/**
 * @brief TIM4 interrupt handler
 */
void TIM4_IRQHandler(void)
{
    Motors_TIM4_IRQHandler();
}

/**
 * @brief TIM5 interrupt handler
 */
void TIM5_IRQHandler(void)
{
    Motors_TIM5_IRQHandler();
}

/**
 * @brief USART2 interrupt handler. FAH
 */
void USART2_IRQHandler(void)
{
    USART2_InterruptHandler();
}